{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 66, 200, 3], "output_shape": null, "arguments": {}, "output_shape_type": "raw", "input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001f<ipython-input-27-f572f8b0b760>\u00da\b<lambda>\n\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "name": "lambda_7", "trainable": true}}, {"class_name": "Convolution2D", "config": {"activation": "elu", "b_regularizer": null, "init": "glorot_uniform", "nb_col": 5, "activity_regularizer": null, "name": "convolution2d_31", "W_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "b_constraint": null, "nb_filter": 24, "bias": true, "nb_row": 5, "subsample": [2, 2], "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activation": "elu", "b_regularizer": null, "init": "glorot_uniform", "nb_col": 5, "activity_regularizer": null, "name": "convolution2d_32", "W_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "b_constraint": null, "nb_filter": 36, "bias": true, "nb_row": 5, "subsample": [2, 2], "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activation": "elu", "b_regularizer": null, "init": "glorot_uniform", "nb_col": 5, "activity_regularizer": null, "name": "convolution2d_33", "W_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "b_constraint": null, "nb_filter": 48, "bias": true, "nb_row": 5, "subsample": [2, 2], "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activation": "elu", "b_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null, "name": "convolution2d_34", "W_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "b_constraint": null, "nb_filter": 64, "bias": true, "nb_row": 3, "subsample": [1, 1], "W_regularizer": null}}, {"class_name": "Convolution2D", "config": {"activation": "elu", "b_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "activity_regularizer": null, "name": "convolution2d_35", "W_constraint": null, "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "b_constraint": null, "nb_filter": 64, "bias": true, "nb_row": 3, "subsample": [1, 1], "W_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_7", "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 1164, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "name": "dense_31", "W_constraint": null, "activity_regularizer": null, "trainable": true, "input_dim": 1152, "bias": true, "W_regularizer": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_13", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 100, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "name": "dense_32", "W_constraint": null, "activity_regularizer": null, "trainable": true, "input_dim": 1164, "bias": true, "W_regularizer": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_14", "p": 0.4, "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 50, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "name": "dense_33", "W_constraint": null, "activity_regularizer": null, "trainable": true, "input_dim": 100, "bias": true, "W_regularizer": null, "b_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_15", "p": 0.3, "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 10, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "name": "dense_34", "W_constraint": null, "activity_regularizer": null, "trainable": true, "input_dim": 50, "bias": true, "W_regularizer": null, "b_constraint": null}}, {"class_name": "Dense", "config": {"output_dim": 1, "activation": "linear", "b_regularizer": null, "init": "glorot_uniform", "name": "dense_35", "W_constraint": null, "activity_regularizer": null, "trainable": true, "input_dim": 10, "bias": true, "W_regularizer": null, "b_constraint": null}}], "keras_version": "1.2.1"}